DataProcessors/УправляемаяЗагрузкаCoMagic.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>УправляемаяЗагрузкаCoMagic</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПолученияОбращенийComagic</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сайты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сайт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПолученияОбращенийComagic</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/УправляемаяЗагрузкаCoMagic/Forms/ФормаУ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Новшество: аккаунт агентский. Пример получения проектов агента: https://api.comagic.ru/api/v1/customer_list/?session_key=0192bc723bc68691c4f3e5eb8bc2a272		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ПериодНачало = НачалоДня(ТекущаяДата());
	Объект.ПериодОкончание = КонецДня(ТекущаяДата());
	
	//Режим = РежимДиалогаВопрос.ДаНет;
	//Текст = "Предварительно загрузить Контакную информацию клиентов?";
	//Ответ = Вопрос(Текст, Режим, 0);
	//Если Ответ = КодВозвратаДиалога.Да Тогда
	//	ЗагрузитьКонтактнуюИнформациюКлиентовНаСервере();	
	//КонецЕсли; 	                                                               
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузку(Команда)
	ВыполнитьЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтактнуюИнформациюКлиентовНаСервере()	
	АдресМВТ = ПоместитьВоВременноеХранилище(УправлениеЗаявкамиНаЗвонок.ПодготовитьТаблицуКлиентов());		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере()
	
	ПараметрыСайтов = УправлениеОбращениямиCoMagic.ПолучитьПараметрыПодключенияComagic(Объект.Сайты.Выгрузить().ВыгрузитьКолонку("Сайт"));
	Если НЕ ПараметрыСайтов = Неопределено И ПараметрыСайтов.Количество() Тогда		
		Если ЭтоАдресВременногоХранилища(АдресМВТ) Тогда
			НайденыеКлиенты_МВТ = ПолучитьИзВременногоХранилища(АдресМВТ);		
		Иначе
			НайденыеКлиенты_МВТ = Неопределено;	
		КонецЕсли;
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(Объект.ПериодНачало);
		ПараметрыЗадания.Добавить(Объект.ПериодОкончание);
		ПараметрыЗадания.Добавить(ПараметрыСайтов);
		ПараметрыЗадания.Добавить(НайденыеКлиенты_МВТ);
		Ключ = "УправляемаяЗагрузкаДанныхCoMagic_" + ТекущаяДата();//Строка(Новый УникальныйИдентификатор);
		Сообщить("Старт задания: " + Ключ);
		ФоновыеЗадания.Выполнить("УправлениеОбращениямиCoMagic.УправляемаяЗагрузкаДанныхCoMagic", ПараметрыЗадания, Ключ, "УправляемаяЗагрузкаДанныхCoMagic"); 		
	КонецЕсли; 	
	
КонецПроцедуры
